Revit 2024 API
PromptForFamilyInstancePlacementOptions Constructor
 Creates a new PromptForFamilyInstancePlacementOptions using default options.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public PromptForFamilyInstancePlacementOptions()
Visual Basic
Public Sub New
Visual C++
public:
PromptForFamilyInstancePlacementOptions()
See Also
PromptForFamilyInstancePlacementOptions Class
PromptForFamilyInstancePlacementOptions Overload
Autodesk.Revit.UI Namespace